Read the car dataset

In [12]:
import pandas as pd
df = pd.read_csv('car.csv')

Get the first 6 lines of the dataset

In [5]:
df.head(6)

   User ID  Gender  Age  AnnualSalary  Purchased
0      385       1   35         20000          0
1      681       1   40         43500          0
2      353       1   49         74000          0
3      895       1   40        107500          1
4      661       1   25         79000          0
5      846       0   47         33500          1

Get the last 3 lines of the dataset

In [6]:
df.tail(3)

     User ID  Gender  Age  AnnualSalary  Purchased
997      407       0   28        138500          1
998      299       0   48        134000          1
999      687       0   44         73500          0

How many rows are there in the dataset?

In [9]:
df.shape[0]

1000

What is the rows and columns count of the dataset?

In [10]:
df.shape

(1000, 5)

How many categorical variable in the dataset?

In [11]:
df.select_dtypes(include=['object']).columns

Index([], dtype='object')

Get the names of the columns of the given dataset

In [13]:
df.columns

Index(['User ID', 'Gender', 'Age', 'AnnualSalary', 'Purchased'], dtype='object')

Get the descriptive statistics of the dataset

In [14]:
df.describe()

           User ID       Gender          Age   AnnualSalary    Purchased
count  1000.000000  1000.000000  1000.000000    1000.000000  1000.000000
mean    500.500000     0.484000    40.106000   72689.000000     0.402000
std     288.819436     0.499994    10.707073   34488.341867     0.490547
min       1.000000     0.000000    18.000000   15000.000000     0.000000
25%     250.750000     0.000000    32.000000   46375.000000     0.000000
50%     500.500000     0.000000    40.000000   72000.000000     0.000000
75%     750.250000     1.000000    48.000000   90000.000000     1.000000
max    1000.000000     1.000000    63.000000  152500.000000     1.000000

How many null values are there in the dataset?

In [7]:
df.isnull().sum()

User ID         0
Gender          0
Age             0
AnnualSalary    0
Purchased       0
dtype: int64

Write the dataframe to excel as "updated_car"

In [17]:
df.to_excel('updated_car.xlsx')

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   User ID       1000 non-null   int64
 1   Gender        1000 non-null   int64
 2   Age           1000 non-null   int64
 3   AnnualSalary  1000 non-null   int64
 4   Purchased     1000 non-null   int64
dtypes: int64(5)
memory usage: 39.2 KB